In [28]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [29]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [30]:
target=df["Survived"]
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [31]:
x=df.drop(["Survived"],axis="columns")
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [32]:
dummies=pd.get_dummies(x.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [33]:
x=pd.concat([x,dummies],axis="columns")
x.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [34]:
x.drop(['Sex','male'],axis='columns',inplace=True)
x.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [35]:
x.columns[x.isna().any()]

Index(['Age'], dtype='object')

In [36]:
x.Age[:20]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
Name: Age, dtype: float64

In [37]:
mymean= x.Age.mean()
mymean

29.69911764705882

In [38]:
x["Age"]=x.Age.fillna(mymean)
x.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [39]:
x.Age[:20]

0     22.000000
1     38.000000
2     26.000000
3     35.000000
4     35.000000
5     29.699118
6     54.000000
7      2.000000
8     27.000000
9     14.000000
10     4.000000
11    58.000000
12    20.000000
13    39.000000
14    14.000000
15    55.000000
16     2.000000
17    29.699118
18    31.000000
19    29.699118
Name: Age, dtype: float64

In [40]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,target,test_size=0.3)

In [41]:
len(x_train)

623

In [42]:
len(x_test)

268

In [43]:
len(x)

891

In [44]:
x_train

     Pclass        Age     Fare  female
607       1  27.000000  30.5000       0
191       2  19.000000  13.0000       0
847       3  35.000000   7.8958       0
452       1  30.000000  27.7500       0
728       2  25.000000  26.0000       0
..      ...        ...      ...     ...
352       3  15.000000   7.2292       0
735       3  28.500000  16.1000       0
33        2  66.000000  10.5000       0
246       3  25.000000   7.7750       1
358       3  29.699118   7.8792       1

[623 rows x 4 columns]

In [45]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [46]:
model.fit(x_train,y_train)

GaussianNB()

In [47]:
model.score(x_test,y_test)

0.7611940298507462

In [48]:
x_test[:10]

     Pclass        Age     Fare  female
160       3  44.000000  16.1000       0
65        3  29.699118  15.2458       0
17        2  29.699118  13.0000       0
54        1  65.000000  61.9792       0
230       1  35.000000  83.4750       1
124       1  54.000000  77.2875       0
598       3  29.699118   7.2250       0
149       2  42.000000  13.0000       0
702       3  18.000000  14.4542       1
277       2  29.699118   0.0000       0

In [49]:
y_test[:10]

160    0
65     1
17     1
54     0
230    1
124    0
598    0
149    0
702    0
277    0
Name: Survived, dtype: int64

In [50]:
model.predict(x_test[:10])

array([0, 0, 0, 0, 1, 1, 0, 0, 1, 0], dtype=int64)

In [51]:
#probabality for survial
model.predict_proba(x_test[:10])

array([[0.97210321, 0.02789679],
       [0.97039243, 0.02960757],
       [0.93634305, 0.06365695],
       [0.62620482, 0.37379518],
       [0.01580901, 0.98419099],
       [0.48628505, 0.51371495],
       [0.96970672, 0.03029328],
       [0.9398073 , 0.0601927 ],
       [0.40220642, 0.59779358],
       [0.93098675, 0.06901325]])